In [1]:
import pandas as pd

In [3]:
data = {
    '2005': [9762546, 3512547, 2517680, 2456016],
    '2010': [9631482, 3393191, 2632035, 2461774],
    '2015': [9904312, 3448737, 2890451, 2466052],
    '2020': [9853972, 3655437, 2466338, 2473990],
    '지역': ['수도권', '경상권', '수도권', '경상권'],
    '증가율': [0.0283, 0.0163, 0.0982, 0.0141]
}

In [4]:
data

{'2005': [9762546, 3512547, 2517680, 2456016],
 '2010': [9631482, 3393191, 2632035, 2461774],
 '2015': [9904312, 3448737, 2890451, 2466052],
 '2020': [9853972, 3655437, 2466338, 2473990],
 '지역': ['수도권', '경상권', '수도권', '경상권'],
 '증가율': [0.0283, 0.0163, 0.0982, 0.0141]}

In [10]:
columns = ['지역', '2005', '2010', '2015', '2020', "증가율"]

In [6]:
columns

['지역', '2005', '2010', '2015', '2020']

In [7]:
index = ['서울', '부산', '인천', '대구']

In [11]:
df = pd.DataFrame(data, columns=columns, index=index)

In [12]:
df

     지역     2005     2010     2015     2020     증가율
서울  수도권  9762546  9631482  9904312  9853972  0.0283
부산  경상권  3512547  3393191  3448737  3655437  0.0163
인천  수도권  2517680  2632035  2890451  2466338  0.0982
대구  경상권  2456016  2461774  2466052  2473990  0.0141

In [13]:
df['증가율']

서울    0.0283
부산    0.0163
인천    0.0982
대구    0.0141
Name: 증가율, dtype: float64

In [14]:
df['증가율'] * 100

서울    2.83
부산    1.63
인천    9.82
대구    1.41
Name: 증가율, dtype: float64

In [15]:
df['증가율']

서울    0.0283
부산    0.0163
인천    0.0982
대구    0.0141
Name: 증가율, dtype: float64

In [16]:
df['증가율'] = df['증가율']*100

In [17]:
df['증가율']

서울    2.83
부산    1.63
인천    9.82
대구    1.41
Name: 증가율, dtype: float64

In [18]:
df

     지역     2005     2010     2015     2020   증가율
서울  수도권  9762546  9631482  9904312  9853972  2.83
부산  경상권  3512547  3393191  3448737  3655437  1.63
인천  수도권  2517680  2632035  2890451  2466338  9.82
대구  경상권  2456016  2461774  2466052  2473990  1.41

In [19]:
(df['2010']-df['2005'])/df['2005']*100

서울   -1.342519
부산   -3.397990
인천    4.542078
대구    0.234445
dtype: float64

In [20]:
((df['2010']-df['2005'])/df['2005']*100).round(2)

서울   -1.34
부산   -3.40
인천    4.54
대구    0.23
dtype: float64

In [21]:
df['증가율 round'] =((df['2010']-df['2005'])/df['2005']*100).round(2)

In [22]:
df

     지역     2005     2010     2015     2020   증가율  증가율 round
서울  수도권  9762546  9631482  9904312  9853972  2.83      -1.34
부산  경상권  3512547  3393191  3448737  3655437  1.63      -3.40
인천  수도권  2517680  2632035  2890451  2466338  9.82       4.54
대구  경상권  2456016  2461774  2466052  2473990  1.41       0.23

In [23]:
del df['증가율 round']

In [24]:
df

     지역     2005     2010     2015     2020   증가율
서울  수도권  9762546  9631482  9904312  9853972  2.83
부산  경상권  3512547  3393191  3448737  3655437  1.63
인천  수도권  2517680  2632035  2890451  2466338  9.82
대구  경상권  2456016  2461774  2466052  2473990  1.41

In [25]:
df[0:2]

     지역     2005     2010     2015     2020   증가율
서울  수도권  9762546  9631482  9904312  9853972  2.83
부산  경상권  3512547  3393191  3448737  3655437  1.63

In [27]:
df[['지역', '2015', '증가율']][0:2]

     지역     2015   증가율
서울  수도권  9904312  2.83
부산  경상권  3448737  1.63

In [28]:
import numpy as np

In [29]:
np.arange(10, 22)

array([10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21])

In [30]:
np.arange(10, 22).reshape(3, 4)

array([[10, 11, 12, 13],
       [14, 15, 16, 17],
       [18, 19, 20, 21]])

In [31]:
df1 = pd.DataFrame(np.arange(10, 22).reshape(3, 4), 
                  columns=['A', 'B', 'C', "D"],
                  index=['a', 'b', 'c'])

In [32]:
df1

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [33]:
df1.loc['a', 'A']

10

In [34]:
df1.loc['b':, 'A' ]

b    14
c    18
Name: A, dtype: int32

In [35]:
df1.loc['a', :]

A    10
B    11
C    12
D    13
Name: a, dtype: int32

In [36]:
type(df1.loc['a', :])

pandas.core.series.Series

In [38]:
df1.loc[['a', 'b'], ['B', 'D']]

    B   D
a  11  13
b  15  17

In [39]:
type(df1.loc[['a', 'b'], ['B', 'D']])

pandas.core.frame.DataFrame

In [40]:
df1.A

a    10
b    14
c    18
Name: A, dtype: int32

In [41]:
df1.A > 10

a    False
b     True
c     True
Name: A, dtype: bool

In [42]:
df1.loc[df1.A > 10, :]

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [43]:
df1

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [44]:
df1[:1]

    A   B   C   D
a  10  11  12  13

In [45]:
type(df1[:1])

pandas.core.frame.DataFrame

In [46]:
df1.A

a    10
b    14
c    18
Name: A, dtype: int32

In [47]:
df1.A > 12

a    False
b     True
c     True
Name: A, dtype: bool

In [48]:
def select_rows(df1):
    return df1.A > 12

In [49]:
select_rows(df1)

a    False
b     True
c     True
Name: A, dtype: bool

In [50]:
df1.loc[select_rows(df1), ['B']]

    B
b  15
c  19

In [51]:
df1.loc['b']

A    14
B    15
C    16
D    17
Name: b, dtype: int32

In [52]:
df1.loc['B']

KeyError: 'B'

In [53]:
df1.loc['e'] = [90, 91, 92, 93]

In [54]:
df1

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21
e  90  91  92  93

In [55]:
df2 = pd.DataFrame(np.arange(10, 26).reshape(4, 4), 
                  columns=np.arange(1,8,2))

In [56]:
df2

    1   3   5   7
0  10  11  12  13
1  14  15  16  17
2  18  19  20  21
3  22  23  24  25

In [57]:
df2.loc[1, 1]

14

In [58]:
df2.loc[1:2, :]

    1   3   5   7
1  14  15  16  17
2  18  19  20  21

In [59]:
df2.loc[1:3, :]

    1   3   5   7
1  14  15  16  17
2  18  19  20  21
3  22  23  24  25